# specify a directory to install
cask_args appdir: '/Applications'
# install packages
brew "git"
brew "gh"
brew "pyenv"
brew "pipenv"
brew "poetry"
brew "awscli"
brew "nvm"
brew "tfenv"
brew "yarn"
brew "python@3.10"
brew "python@3.9"
brew "python@3.8"
brew "postgresql"
brew "sqlite"
brew "protobuf"
brew "cruft"
brew "openssl"
brew "readline"
brew "xz"
brew "zlib"
# casks / applications
cask "iterm2"
cask "visual-studio-code"
cask "gpg-suite"
cask "mongodb-compass"
cask "docker"
cask "firefox"
cask "bitwarden"
cask "google-chrome"
cask "postman"
cask "insomnia"
cask "spotify"
cask "slack"
cask "discord"
cask "alfred"